// Copyright Shreevatsa R, 2010. Licenced under the GPL, version 2 or later.

var virama = '्';
var implicita = 'अ';



var barematras = {
  'sk' : ['', 'ा', 'ि', 'ी', 'ु', 'ू',
          'ृ', 'ॄ', 'ॢ', 'ॣ',
          'े', 'ै',
          'ो', 'ौ']
};
var vowels = ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ',
              'ऋ', 'ॠ', 'ऌ', 'ॡ',
              'ए', 'ऐ', 'ओ', 'औ'];
var symbols = ['ं', 'ः', 'ऽ', '।', '॥',
               '०', '१', '२', '३', '४', '५', '६', '७', '८', '९'];
var noncons = vowels.length + symbols.length;

var consonants = ['क', 'ख', 'ग', 'घ', 'ङ',
                  'च', 'छ', 'ज', 'झ', 'ञ',
                  'ट', 'ठ', 'ड', 'ढ', 'ण',
                  'त', 'थ', 'द', 'ध', 'न',
                  'प', 'फ', 'ब', 'भ', 'म',
                  'य', 'र', 'ल', 'व',
                  'श', 'ष', 'स', 'ह'];

var thI = '  ิ  '.trim();
var thIlong = '  ี  '.trim();
var thU = '  ุ  '.trim();
var thUlong = '  ู  '.trim();
var thRi = ' ฺฤ'.trim();
var thRiLong =  ' ฤๅ'.trim();
var thE= 'เ';
var thAi = 'ไ';
var thO = 'โ';
var thAu = 'ะอุ';

var viramaTh = '  ฺ  '.trim();
var implicitaTh = 'อ';
                  
var barematrasTh = {
  'Pali' : ['', 'ा', thI, thIlong, thU, thUlong,
          thRi, thRiLong, 'ฦ', 'ฦๅ',
          'เ', 'ไ',
          'ไ', 'ะอุ']
};

              
var vowelsTh = ['อ', 'อา', 'อิ', 'อี', 'อุ', 'อู',
              'ฤ', 'ฤๅ', 'ฦ', 'ฦๅ',
              'เอ', 'ไอ', 'โอ', 'ะอุ'];
                            
//var symbolsTh = ['ํ' , 'ः', 'ऽ', '।', '॥',
var symbolsTh = ['ํ' , 'ฮ', 'ऽ', '।', '॥',
               '๐', '๑', '๒', '๓', '๔', '๕', '๖', '๗', '๘', '๙'];
var nonconsTh = vowelsTh.length + symbolsTh.length;

var consonantsTh = ['ก', 'ข', 'ค', 'ฆ', 'ง',
                  'จ', 'ฉ', 'ช', 'ฌ', 'ญ',
                  'ฏ', 'ฐ', 'ฑ', 'ฒ', 'ณ',
                  'ต', 'ถ', 'ท', 'ธ', 'น',
                  'ป', 'ผ', 'พ', 'ภ', 'ม',
                  'ย', 'ร', 'ล', 'ว',
                  'ศ', 'ษ', 'ส', 'ห'];


var alphabets = {
	
/*'Pali':          ['a', 'ā', 'i', 'ī', 'u', 'ū',
                'ṛ', 'ṝ', 'ḷ', 'ḹ',
                'e', 'ai', 'o', 'au',

              'ṁ', 'ḥ', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                'k', 'kh', 'g', 'gh', 'ṅ',
                'c', 'ch', 'j', 'jh', 'ñ',
                'ṭ', 'ṭh', 'ḍ', 'ḍh', 'ṇ',
                't', 'th', 'd', 'dh', 'n',
                'p', 'ph', 'b', 'bh', 'm',
                'y', 'r', 'l', 'v',
                'ś', 'ṣ', 's', 'h'],*/

'sk': vowels.concat(symbols).concat(consonants),
'Pali': vowelsTh.concat(symbolsTh).concat(consonantsTh),


'harvardkyoto':['a', 'A', 'i', 'I', 'u', 'U',
              'R', 'RR', 'lR', 'lRR',
              'e', 'ai', 'o', 'au',

              'M', 'H', '\'', '.', '..',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

              'k', 'kh', 'g', 'gh', 'G',
              'c', 'ch', 'j', 'jh', 'J',
              'T', 'Th', 'D', 'Dh', 'N',
              't', 'th', 'd', 'dh', 'n',
              'p', 'ph', 'b', 'bh', 'm',
              'y', 'r', 'l', 'v',
              'z', 'S', 's', 'h'],
        

'itrans':     ['a', ['aa','A'], 'i', ['ii','I'], 'u', ['uu','U'],
              ['RRi','R^i'], ['RRI','R^I'], ['LLi','L^i'], ['LLI','L^I'],
              'e', 'ai', 'o', 'au',

              'M', 'H', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

              'k', 'kh', 'g', 'gh', ['~N','N^'],
              'ch', 'Ch', 'j', 'jh', ['~n','JN'],
              'T', 'Th', 'D', 'Dh', 'N',
              't', 'th', 'd', 'dh', 'n',
              'p', 'ph', 'b', 'bh', 'm',
              'y', 'r', 'l', ['v','w'],
              'sh', 'Sh', 's', 'h'],

'velthuis':   ['a', 'aa', 'i', 'ii', 'u', 'uu',
              '.r', '.rr', '.l', '.ll',
              'e', 'ai', 'o', 'au',

               '.m', '.h', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

              'k', 'kh', 'g', 'gh', '"n',
              'c', 'ch', 'j', 'jh', '~n',
              '.t', '.th', '.d', '.dh', '.n',
              't', 'th', 'd', 'dh', 'n',
              'p', 'ph', 'b', 'bh', 'm',
              'y', 'r', 'l', 'v',
               '"s', '.s', 's', 'h'],

'iast':          ['a', 'ā', 'i', 'ī', 'u', 'ū',
                'ṛ', 'ṝ', 'ḷ', 'ḹ',
                'e', 'ai', 'o', 'au',

              'ṁ', 'ḥ', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                'k', 'kh', 'g', 'gh', 'ṅ',
                'c', 'ch', 'j', 'jh', 'ñ',
                'ṭ', 'ṭh', 'ḍ', 'ḍh', 'ṇ',
                't', 'th', 'd', 'dh', 'n',
                'p', 'ph', 'b', 'bh', 'm',
                'y', 'r', 'l', 'v',
                'ś', 'ṣ', 's', 'h'],

'IAST':          ['A', 'Ā', 'I', 'Ī', 'U', 'Ū',
                'Ṛ', 'Ṝ', 'Ḷ', 'Ḹ',
                'E', 'Ai', 'O', 'Au',

                  'Ṃ', 'Ḥ', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                'K', 'Kh', 'G', 'Gh', 'Ṅ',
                'C', 'Ch', 'J', 'Jh', 'Ñ',
                'Ṭ', 'Ṭh', 'Ḍ', 'Ḍh', 'Ṇ',
                'T', 'Th', 'D', 'Dh', 'N',
                'P', 'Ph', 'B', 'Bh', 'M',
                'Y', 'R', 'L', 'V',
                'Ś', 'Ṣ', 'S', 'H'],
                
'BALARAM':          ['A', 'Ä', 'I', 'É', 'U', 'Ü',
                'Å', 'È', 'ß', 'Ḹ',
                'E', 'Ai', 'O', 'Au',

                  'À', 'Ù', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                'K', 'Kh', 'G', 'Gh', 'Ì',
                'C', 'Ch', 'J', 'Jh', 'Ï',
                'Ö', 'Ṭh', 'Ò', 'Ḍh', 'Ë',
                'T', 'Th', 'D', 'Dh', 'N',
                'P', 'Ph', 'B', 'Bh', 'M',
                'Y', 'R', 'L', 'V',
                'Ç', 'Ñ', 'S', 'H'],                
                
                
'balaram':     ['a', 'ä', 'i', 'é', 'u', 'ü',
                'å', 'è', 'ÿ', 'û',
                'e', 'ai', 'o', 'au',

              'à', 'ù', '\'', '|', '||',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                'k', 'kh', 'g', 'gh', 'ì',
                'c', 'ch', 'j', 'jh', 'ï',
                'ö', 'ṭh', 'ò', 'ḍh', 'ë',
                't', 'th', 'd', 'dh', 'n',
                'p', 'ph', 'b', 'bh', 'm',
                'y', 'r', 'l', 'v',
                'ç', 'ñ', 's', 'h'], 
                
                               
'slp':			['a', 'A', 'i', 'I', 'u', 'U',
                'f', 'F', 'x', 'X',
                'e', 'E', 'o', 'O',
        
                'M', 'H', '\'', '|', '||',
                '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
                   
                'k', 'K', 'g', 'G', 'N',
                'c', 'C', 'j', 'J', 'Y',
                'w', 'W', 'q', 'Q', 'R',
                't', 'T', 'd', 'D', 'n',
                'p', 'P', 'b', 'B', 'm',
                'y', 'r', 'l', 'v',
                'S', 'z', 's', 'h'],

// 'kannada':       ['ಅ', 'ಆ', 'ಇ', 'ಈ', 'ಉ', 'ಊ',
//                   'ಋ', 'ೠ', 'ಌ', 'ೡ',
//                   'ಏ', 'ಐ', 'ಓ', 'ಔ',
//                   'ಂ', 'ಃ',

//                   'ಕ', 'ಖ', 'ಗ', 'ಘ', 'ಙ',
//                   'ಚ', 'ಛ', 'ಜ', 'ಝ', 'ಞ',
//                   'ಟ', 'ಠ', 'ಡ', 'ಢ', 'ಣ',
//                   'ತ', 'ಥ', 'ದ', 'ಧ', 'ನ',
//                   'ಪ', 'ಫ', 'ಬ', 'ಭ', 'ಮ',
//                   'ಯ', 'ರ', 'ಲ', 'ವ',
//                   'ಶ', 'ಷ', 'ಸ', 'ಹ'],

'ipa':           ['ɐ', 'ɑː', 'i', 'iː', 'u', 'uː',
                  'ɻ', 'ɻː', 'ɭ', 'ɭː',
                  'eː', 'əi', 'oː', 'əu',

                  '[anusvara]', '[visarga]', '[elided a]', '', '',
              '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

                  'k', 'kʰ', 'g', 'gʱ', 'ŋ',
                  //'c͡ç', 'c͡çʰ', 'ɟ͡ʝ', 'ɟ͡ʝʱ', 'ɲ',
                  'c', 'cʰ', 'ɟ', 'ɟʱ', 'ɲ',
                  'ʈ', 'ʈʰ', 'ɖ', 'ɖʱ', 'ɳ',
                  't̪', 't̪ʰ', 'd̪', 'd̪ʱ', 'n̪',
                  'p', 'pʰ', 'b', 'bʱ', 'm',

                  'j', 'r', 'l', 'ʋ',
                  'ɕ', 'ʂ', 's̪', 'ɦ']
};

